first_explanation = '자신의 성격에서 관심과 에너지의 방향 즉, 내외향성을 우선 보여주고, 그리고 정보를 입수하는 방법(Sensation감각형 또는 ' \
              'iNtuition직관형)과 판단하는 방식(Thinking 사고형, Feeling감정형)을 보여주는 좋은 자료입니다. ' \
              '그리고 마지막으로 자신의 삶의 스타일, 즉 ‘계획형(Judging)인가? 충동.융통.개방.포용.인식형(Perceiving)인가?’를 보여줍니다.' \
              '하지만 기질이론은 사람을 외․내향형으로 구분하는 너무 단순한 이분법을 보완하고 있습니다. ' \
              '같은 외향형이지만 따뜻하고 유쾌하고 다정한 외향형과 활동적이고 지시하기 좋아하고 ' \
              '두목 행세하는 외향형은 구분되어야 마땅하기 때문입니다. ' \
              '따라서 이 기질이론은 자신의 행동성향의 주요 동인(動因). 지향성. 경향성 등을 보여줄 수 있어 자신과 타인의 사고와 행동을 이해하는데 아주 유용합니다. ' \
              '이와 더불어서 자신의 강약점을 잘 알 수 있고, 또 보완하도록 이끌어 줍니다. 물론 MBTI를 통해서도 자신의 정보 수집방식과 ' \
              '판단유형의 장단점을 알고 또 보완해야 할 점을 알 수 있지만, 설명하는 사람이 상세히 정확히 잘 설명해주어야 하는데 제가 경험한 바에 의한면 별로 그렇지 못한 것 같습니다.' \
              '한편 기질 및 개인의 성향에 대한 이론들은 서로 강약점을 지니고 있습니다. 그러므로 상호보완적으로 사용하면 더욱 유익하리라고 생각합니다.(애니어그램 포함)' \
              '*체크하는 방법 문항수는 총 40입니다. 각 문항의 4개의 보기들 중에서 한 개를 체크합니다. ' \
              '현재의 자기 모습에 가장 가까운 것을 표시하는 것입니다. 하나도 빠뜨리지 말고 답하십시오. ' \
              '혹시 잘 모르는 문항은 당신의 어렸을 적 모습이나 친구에게 물어보셔도 좋습니다.' \
              '끝으로 기질들 사이에서는 우월한 것이나 열등한 것이 없습니다.현재 있는 모습 그대로 표시하면 정확한 진단에 가깝게 나올 것입니다.'


#다혈
Bloody = '1. 활발한 다혈질 또는 즐거운 다혈질(多血質)' \
         '삶의 동인(動因): “즐겁게(재밌게) 살자.”이며 삶의 방식은 “재밌게 하자”이다' \
         '이 사람은 관계에서 힘을 얻는다' \
         '다혈질은 인기 있다, 매력적이다, 다른 사람들을 기쁘게 하려한다.' \
         '그러나 만약 부모를 기쁘게 하려고 애쓰다가도 그것이 불가능하다는 것을 깨달을 경우 ' \
         '다른 사람들( 예, 친구들)을 즐겁게 하려고 애를 쓴다. ' \
         '다혈질에게 이 세상은 신나는 곳으로 탐험심이 많고 열정적이다. ' \
         '다혈질은 쉴새 없이 재잘거린다. 그러나 주의가 산만, ' \
         '즉 주의집중력이 약하므로 마무리가 약하다. 또한 그 일들에 금새 싫증을 낸다. ' \
         '쉽게 포기하고 인내심이 부족하다. 그러므로 누군가가 확인해줘야 한다. 감정의 기복이 심하고 무질서하다(조직적인 것과는 거리가 멀다)' \
         '옳고 그름보다는 싫고 좋음, 즉 감정에 따라 판단하고 결정을 내린다. ' \
         '이러한 태도가 나쁜 것만은 아니지만 옳고 그름에 따라 행동하기도 해야 하므로 우리는 이 둘 사이의 지혜로운 균형이 필요하다.' \
         '눈앞의 문제를 덮기 위해 거짓말을 하기 쉬운 성향을 지니고 있다.' \
         '그의 관심사는 지금 당장 어떻게 되는 것뿐인 것 같다. 이를 바로 잡아 줘야 한다. 때로는 벌이 필요하다.' \
         '건망증이 있다. 그러나 이름 등을 기억함은 존경의 표시임을 기억하고 이를 중요하게 여기도록 해야 한다.' \
         '네 기질들 중 기질상 비행에 빠질 가능성이 가장 높다. ' \
         '그러므로 어려서부터 정말 즐거운 것이 무엇이고, 규칙과 법을 지키도록 모범을 보이고 가르쳐야 한다.' \
         '학생의 경우 숙제를 싫어하는 성향이 제일 크므로 재미있게 지도해줘야 한다.' \
         '다혈질과 적합한 일 : 탁월한 영업사원이 될 가능성이 많다(외판원의 3분의2 정도가 다혈질일 것). ' \
         '재능 있는 배우․설교자(특히 부흥사)․정치인, 유능한 사회자, ' \
         '때로는 지도자(다른 기질이 적절히 섞여 있는 경우)도 된다. 활기찬 간호사․의사로 환자들을 행복하게 하기도 한다.' \
         '다혈질은 혈액이 지배적인 체액일 때 나타나는 기질로서 성격이 겉으로 드러나며 외향적이다. ' \
         '보통 먼저 대화를 시작하고 즉각적인 반응을 드러내며 감정의 변화가 심하다.' \
         '큰 소리로 웃거나 대화를 주도하여 주목받는 것을 즐기며 웅변이 뛰어나다. 주변 사람과 사물에 대해서 늘 호기심을 가지며 환경에 잘 적응한다. ' \
         '낙천적이어서 좌절하거나 미래에 대하여 두려움을 갖지 않으며 쉽게 과거를 잊는다. ' \
         '끊임없이 여러 가지 계획을 세워 추진한다. 첫인상이 좋아 사교적이고 다른 사람들에게 진실한 마음을 갖는다. '



#담즙
gall = '2. 든든한 담즘질 또는 역동적인 담즙질(膽汁質)' \
            '다혈질과 같은 외향적․낙천적․튀는 기질로써 담즙질이 있다.' \
            '삶의 동인은 “목표를 달성하자 또는 성공하자”이며, 삶의 방식은 “내 뜻대로, ' \
            '내 방식대로 한다.”이다. 그러나 이것이 지나치면 독재자가 되므로 주의해야 한다. ' \
            '잠재력이 가장 많은 사람이다. 그러므로 자제(력)를 갖춘 지도자로 이들을 키우며 ' \
            '또 자기 스스로 그것을 배우라. 담즙질은 성취에서 살맛을 느낀다. ' \
            '힘이 넘치고 모험적이고 단호하며 용감하고 공격적이고 고집이 세다. 자립심이 강하고 독립적이며 경쟁심이 크다.' \
            '시간개념은 “지금 당장”이다. 즉, 미루는 법이 없다. 잠이 없고 생산적이고 목표지향적이다. ' \
            '위기 대처능력이 탁월하나, 친구들을 괴롭힌다. 물론 자기 나름대로 명분이 있겠지만. ' \
            '목표달성에 필요한 만큼은 조직적이고 성적에 있어 필요한 만큼만 점수를 따려고 한다. ' \
            '날카로운 지성과 탁월한 답변을 무기 삼아 자신에게 반대하는 사람들을 박살낸다. 그러나 사람들에게 인기는 없다.' \
            '그러므로 담즙질에게 어려서부터 정정당당하게 지는 법을 가르쳐라. 책임을 맡기라. ' \
            '그는 책임 맡는 것을 좋아하며 활동적인 것을 좋아하고 지루한 것은 피하려 든다.' \
            '담즙질과 적합한 일: 담즙질은 세부사항과 분석적 기획에 대한 지나친 부담이 없는 한 ' \
            '지도력과 강한 성취욕, 높은 생산성이 필요한 일자리를 고려해 볼 만하다. ' \
            '보통은 기술자는 아니지만 기술자들을 감독하는 일은 종종 맡는다. 현명한 담즙질은 우울질 동업자나 조수와 함께 일한다. ' \
            '대부분의 기업가는 담즙질이다. 그는 타고난 홍보능력으로 영업과 실용과목을 가르치는 교직, 정치, 군대, ' \
            '스포츠와 다른 여러 활동에서 두각을 나타낸다. 담즙질은 다혈질처럼 좋은 설교자가 되나 감정에 호소하는 면에서는 좀 떨어진다. ' \
            '세계의 유명한 장군들, 독재자들, 갱단의 두목들의 상당수가 담즙질 성향이 강한 인물들이다. ' \
            '그는 ‘성공성향’이 누구보다도 강하다. 그러므로 그는 선한 성공, 아름다운 성공을 추구할 때 ' \
            '진정한 성취를 달성할 수 있음을 기억하고 실천한다면 유능한 인물이 될 것이다.' \
            '담즙질은 담즙이 지배적인 체액으로서 스스로 결정하는 성향이 강하고 자신의 능력에 확신을 가지며 매우 진취적이다. ' \
            '자신이 원하는 방향으로 계획을 추진하며 분석적으로 추정하기보다 직관으로 결정한다. 일에 차질이 생겼을 때는 재빨리 대처하며 단호하게 처리한다. ' \
            '모든 일을 낙천적으로 생각하여 한번 일을 계획하면 불가능한 상황이어도 쉽게 바꾸지 않는다. ' \
            '다른 사람들의 생각에 그다지 영향을 받지 않으며 남들이 동의하지 않아도 계속 매진하므로 자기 과신에 빠지기 쉽다. ' \
            '모험심이 강하여 어려움에 처할수록 더욱 더 고무된다.'


#우울
depressed ='3. 거장 우울질 또는 완벽한 우울질(憂鬱質)' \
           '다혈질과는 감정적으로 같은 선상에 있고, 담즙질과는 일 중심의 같은 성향을 지닌 기질이 우울질이다. ' \
           '우울질의 삶의 동인은 “완벽하게 살자(갖추자), 옳은 방식대로 살자(하자)”이다. ' \
           '이런 태도 역시 좋으나, 그것이 지나치면 자신과 다른 사람들을 피곤하고 힘들게 만들며 생산성을 떨어뜨린다.' \
           '그는 재능이 가장 많은 사람이다. 그는 심각하고 조용하며, ' \
           '짜여진 일정을 좋아하고 규칙적이고 아이의 경우 잘 울며(감정적이며) 순종적이다. ' \
           '완벽주의자로 정리정돈과 청결을 누구보다 추구한다. 생각이 깊고 책 읽기를 좋아하며 연구에 적합한 스타일이다. ' \
           '집중력이 뛰어나고(혹은 어떤 일에 몰입하는 성향이 강하고) 의무감․책임감이 강하다. ' \
           '뭔가를 제대로 하는 데 모든 걸 걸며 비판에 과민하다. 모범생(스타일)이고, ' \
           '조직적이고 목표의식이 분명하고 성실하며 시간을 준수한다. 검소하고 의심이 많고 앙심이 깊다.' \
           '우울질은 교만과 비판, 타인을 판단하는 것을 주의해야 한다.' \
           '위와 같은 누구보다 많은 재능을 가진 우울질이, 그러나 자기의 의도대로 일이 되지 않으면 의기소침하고 우울해지며 우는 소리를 한다.' \
           '자, 이 완벽주의자를 어떻게 도울 것인가?' \
           '먼저, 당신은 세상이 불완전함을 받아들여야 한다. ' \
           '또 자기가 잘 할 수 있는 영역을 한 가지 이상 찾도록 하고, 이들을 도우라. ' \
           '무엇보다 삶의 기준을 낮추라. 즉 현실적이 되라는 뜻이다. 그래서 성취를 통하여 만족을 얻으라.' \
           '우울질의 정서적 욕구는 고요, 자기공간, 안위, 안정감이다. ' \
           '우울질은 우울(또는 심각)을 극복하라. 부정적인 면이나 모습보다는 긍정적이고 좋은 면들을 보고 감사하고 그것을 누리라.' \
           '우울질은 좋고 싫은 것보다는 옳고 그름에 따라 판단하고 결정을 내린다.' \
           '이런 태도는 필요하지만 반드시 옳은 것만은 아니므로 때로는 자기의 좋고 싫음에 따라 결정할 필요도 있음을 알고 양자 사이의 균형이 필요하다.' \
           '우울질과 적합한 일: 세계의 위대한 예술가, 발명가, 철학자, 이론가, 신학자, 과학자 그리고 헌신적인 교육자들은 우울질 성향이 많았다. ' \
           '놀랍게도 외향적 사람들이 도맡아 할 것 같은 연기도 우울질은 연기에 매력을 느끼고 잘 하나, 무대에서 내려오면 본래의 기질로 되돌아간다. ' \
           '우울질은 사람들을 돕는 직업에 매력을 느낀다. 그는 철저함과 자기 희생과 창의성이 필요한 직업에 제격이다. ' \
           '그러나 자신의 능력을 과소평가하고 약점을 과장함으로써 스스로의 잠재력을 제한하는 성향이 있음을 자각하고 균형과 조화를 추구해야 하며, ' \
           '감사하고 기뻐하는 생활을 힘써야 한다.' \
           ' 우울질은 흑담즙이 지배적인 경우로서 여러 기질 가운데 가장 신중하고 민감하며 일반적으로 지능지수가 높다. ' \
           '음악·미술·운동 등의 예술 분야에 뛰어나다. 잘 감동하고 상처받기 쉬우나 사려 깊으며 가치 있고 유익하며 창조적인 생각을 해낸다. ' \
           '분석력이 뛰어나고 잠재적인 문제점을 끄집어내며 완벽주의자적인 성향이 있다. ' \
           '앞에 나서기보다는 뒤에서 일하기를 즐긴다. 때로 자신을 따르는 사람들을 위하여 헌신하려는 욕구가 있어 매우 희생적인 삶을 선택하기도 한다. ' \
           '과식·게으름 등 자신의 편안함을 쫒지 않는다. ' \
           '정해진 시간과 자신이 세운 높은 수준을 지키기 위하여 늘 일에 매달린다. 큰일을 해내고 나면 몸과 마음이 탈진하여 깊은 좌절감에 빠지기도 한다.'

#점액
mucus = '점액질은 우울질과 같이 에너지의 방향이 내향적이고 조용하며 염세적(비관적)인 분석적 기질이면서 ' \
        '한편으로 다혈질과 같이 일이 아닌 사람(혹은 관계) 중심적인 기질은 점액질이다.' \
        '점액질의 삶의 동인은 “편(안)하게 살자. 쉽게 살자.”이며 삶의 방식은 “쉽게(쉬운 방식대로) 하자”이다. ' \
        '이런 삶의 동인과 방식 역시 대체로 좋다고 할 수 있으나 것이나 삶이란 자기 마음대로 되는 게 아닌 것, ' \
        '그러므로 필요할 경우 그(녀)는 진리, 질서, 규칙, 방식을 따라야 함을 배워야 한다. 또는 그(녀)는 남을 닮아 가는 성향이 강하다.' \
        '점액질은 평온하고 무난하며 요구사항이 별로 없다. 행복하고 즐거워하며 만족한다. 따라서 호감 가는 성격으로 보이며 재치있고 다른 사람들의 말을 잘 들어준다.' \
        '그러나 행동이 느리고-심지어 아이들의 경우 기고 걷는 데도 느리다-, 낯가림이 심하고 무관심하고 상관 않는 태도를 보이며 방관자 혹은 관찰자적 태도를 보인다. ' \
        '갈등을 피하려고 하며 온순하다. 일을 회피하려고 하며 누구보다도 휴식을 원한다. ' \
        '싸움을 부추기고 선동하며 무서워한다. 지나치게 타협적이고 열정이 없으며 은근히 고집이 세고 빈정댄다.' \
        '자, 이 점액질의 장점을 살리고 약점을 극복하도록 어떻게 도울 수 있을까?' \
        '그는 거절과 실패에 대한 두려움이 많다. 이의 극복방법으로 그이 자존감을 키워주자. ' \
        '용납이 핵심이다. 완벽을 기대하지 말라. 함께하고 도와주자. 그는 한가지 일에 몰두하는 성향(방향성)이 강하다. 사랑으로 동기를 부여하고 실패해도 자랑스러워하자.' \
        '점액질과 적합한 일: 점액질은 교육분야에 매력을 느낀다. ' \
        '대부분의 초등학교 교사들은 점액질이다. 점액질의 부드러운 성품이 수업의 분위기를 따뜻하게 한다. ' \
        '고등학교와 대학의 수학, 물리학, 문법(또는 어법), 문학, 언어 수업에서도 마찬가지고 교직원, 도서관 사서, 카운슬러(=상담가), ' \
        '대학 학과장 중 점액질을 흔히 접할 수 있다. 그는 또 공학분야에 매력을 느끼고, ' \
        '계획과 계산을 좋아하기 때문에 훌륭한 건축사나 위생 전문가, 각종 기사나 이공(理工) 계통의 학자가 된다. ' \
        '원만하고 무난한 점액질은 사람들과도 잘 어울리며 모험을 절대하지 않는다. ' \
        '그러므로 공직 등 안전한 직장에 매력을 느끼고 웬만해서는 자기 사업을 벌이지 않고 소박한 생활에 만족한다.' \
        '점액질은 자극에 대해 흥분하거나 격분하는 일이 적고, 활발하지 못하지만 일단 일을 시작하면 의지가 강하고 인내력이 있다. ' \
        '독일의 철학자 칸트에 의하면 점액질은 담즙질과 함께 혈액의 온도로 분류하면 냉혈에 속한다. ' \
        '독일의 심리학자인 분트는 정의(情意)의 작용의 강약과 그 변화의 지속으로 보아 느리고 약한 것을 점액질이라고 하였다. '


#다혈담즙
Bloody_gall_summary = ['✍ 장점：외향적, 열정적, 적극성, 개방적',
                      '✍ 약점：정도 이상의 말로 약점 노출, 강한 자아의식, 분노, 고집, 혈압주의',
                      '✍ 훈련：집중력, 계획성, 자제력을 길러 준다.',
                      '✍ 인물：베드로',
                      '✍ 은사：자비, 전도, 목양, 가르침, 권면, 예언, 주는 은사, 돕는 은사, 믿음, 지식, 분별, 지혜, 다스림',
                      '- 따뜻하고, 열정적이며, 순발력이 뛰어남',
                      '- 사교성이 풍부하고, 지도력이 있음',
                      '- 가장 강한 외향적인 사람',
                      '- 카리스마와 함께 사람들과 잘 사귈 수 있게 됨',
                      '- 지도자 유형',
                      '- 외판원의 특성',
                      '- 솔직하여 말이 많고 화를 잘 낸다. ',
                      '- 다혈질의 부주의한 면과 담즙질의 고집스러운 궤변이 결합한 까닭에 창조적인 도덕심을 갖지 못하고, 자신의 행동을 정당화시키는 경향이 있다.']


Bloody_gall = '기질 조합 가운데 가장 외향적인 조합은 두 외향적 기질이 결합된 다혈담즙질이다.' \
              '유쾌한 카리스마의 다혈질 때문에 이 사람은 사람 중심의 열정적인 영업사업 유형이 된다. ' \
              '또한 담즙질 성품으로 인한 결단력과 기개로 순수한 다혈질보다 좀더 조직적이고 일도 잘한다.' \
              '직업 면에서 다혈담즙질은 영업이나 홍보사원으로 출발해서 영업부장 자리까지 오르는 경우가 많다. ' \
              '대인관계가 주를 이루는 분야라면 모두 적합하지만, 흥미를 잃지 않으려면 다양한 경험과 활동과 자극이 있어야 한다. ' \
              '다혈담즙질 남성은 하나같이 스포츠에 열광한다. 가정에서 적절한 교육과 동기 부여와 사랑을 받고 약점에 얽매이지 않는다면 경제적으로 성공 할 수 있다. ' \
              '다혈담즙질의 약점은 보통 분명하게 드러난다. 흔히 말이 너무 많다 보니 상황을 제대로 알기도 전에 말을 쏟아낸다. ' \
              '솔직히 그 누구보다 입 때문에 많은 곤경을 겪는다.' \
              '다혈담즙질은 좋은 첫인상을 남기지만 강한 자의식으로 대화를 독점하는 바람에 첫 인상을 망쳐버릴 때가 많다. ' \
              '사람들이 자신을 거부한다는 느낌이 들면 오히려 더 강하게 나와서 상황을 악화시키기도 한다. ' \
              '파티의 활력소에다 사랑스러운 사람이지만 위협이나 불안감을 느끼면 밉살스럽게 굴 수 있다. ' \
              '정서적으로 가장 두드러진 문제는 분노다. 사소한 일에도 발끈하여 무모한 행동을 할 수 있다. ' \
              '다혈담즙질은 자기 뜻에 맞는 사람에겐 칭찬을 아끼지 않지만, 방해가 되는 사람에겐 험담을 퍼붓는다. ' \
              '다혈질답게 잘 잊어버리는 데다 “목적이 수단을 정당화 한다”는 사고방식을 갖고 있어 양심이 비교적 무디고 자신의 행동을 정당화하려는 경향이 있다. '






#다혈우울

Bloody_depressed_summary = ['✍ 장점：연극, 탤런트, 음악, 과학 뛰어남. 잠재 능력이 많다, 협조자, 사교가.',
                   '✍ 단점：의지가 약하다, 몽상적, 감정 변화의 기복이 심함, 거짓말, 이간질, 충동적.',
                   '✍ 훈련：타인의 긍정적인 호의를 받아들임, 사랑과 격려가 필요하다.',
                   '✍ 인물：다윗',
                   '✍ 은사：자비, 전도, 예언, 가르침, 권면, 목양, 주는 은사, 지혜, 지식, 분별, 돕는 은사, 다스림, 믿음',
                   '- 감정의 변화가 심한 대단히 감정적인 사람',
                   '- 동정심이 많아 다른 사람의 인생에 도움을 줌',
                   '- 몽상가적임',
                   '- 자기도취와 쉽게 화를 잘 내고 두려움이 많음',
                   '- 다른 사람에게 인정받는 것을 중요하게 여김',
                   '- 독창적임',
                   '- 창의력과 비판분석력이 뛰어나며, 재능이 많음',
                   '- 풍부한 상상력',
                   '- 새로운 일을 시도하는 솔선력이 강하며 논리적',
                   '- 사고력에 있어서는 몽상가',
                   '- 다른 사람의 슬픔을 진심으로 함께 함',
                   '- 때로는 남에게 비평을 가함으로써 다른 이들로부터 소외되며 이기심, 거만, 상대에 대한 적대감을 불러일으킬 수 있음']

Bloody_depressed = '다혈우울질은 감정의 기복이 대단히 심하다. 갑자기 미친 듯이 웃는가 하면 다음 순간 눈물을 터뜨리곤 한다. ' \
                   '슬픈 이야기를 듣거나 다른 사람의 가슴 아픈 곤경을 목격하거나 슬픈 음악을 들을 때마다 한없이 눈물을 흘린다. ' \
                   '다른 사람들의 슬픔을 진심으로 가슴 아파한다. ' \
                   '다혈우울질 의사는 언제나 환자들을 따뜻하게 대한다. 다혈질은 보통 환상적인 교사가 된다. ' \
                   '대학에서 손쉽게 인기를 독차지하는 교수들이 바로 그들이다.' \
                   '다혈우울질은 언제나 사람들과 함께 일해야 한다. 사람들에게 존경받는 것을 중요하게 생각하기 때문에 맡은 일을 꾸준히 해나간다. ' \
                   '대중 강연, 연기, 음악이나 예술 분야를 고려해봄직하다. 다혈질의 대중 강사 중에서도 다혈우울질은 가장 정확한 통계수치를 사용한다.' \
                   '그러나 다혈우울질이 특유의 완벽주의 성향을 자제하지 못할 때 사람들을 마구 비판하게 되고 그 바람에 외톨이가 될 수 있다. ' \
                   '그는 인간관계를 소중히 여길 줄 알고 다른 사람들에게 도움을 줄 수 있는 충분한 잠재력이 있다. ' \
                   '다만 자의식과 오만 때문에 밉살스럽게 굴다가 다른 사람들의 미움을 받지 않도록 조심해야 한다.' \
                   '다혈질과 우울질 모두 몽상가이다 보니 다혈우울질의 가장 큰 취약점은 바로 생각에 있다. ' \
                   '그는 모욕과 상처를 곱씹다 자신을 학대하는 지경에 이를 수도 있다. 다혈질과 우울질 모두 불안을 이기지 못한다. ' \
                   '그 두려움 때문에 잠재력을 제대로 발휘하지 못 할 수 있다. 게다가 다혈우울질은 분노 또한 문제가 될 수 있다. '

#다혈점액
Bloody_mucus_summary = ['✍ 장점：상냥, 태평, 풍부한 유머, 친화력, 애완동물을 좋아함.',
                       '✍ 단점：무절제, 강한 식욕, 목표의식 결여, 실수 반복',
                       '✍ 훈련：자제력과 적당한 훈육, 음식 절제 ',
                       '✍ 인물：아볼로',
                       '✍ 은사：자비, 전도, 목양, 가르침, 예언, 권면, 지혜, 주는 은사, 지식, 돕는 은사, 분별, 다스림, 믿음',
                       '- 사람들이 가장 쉽게 좋아할 수 있는 사람',
                       '- 근심, 걱정 없고 풍부한 유머를 가지고 있음',
                       '- 자기 동기부여보다는 환경이나 상황에 지배됨',
                       '- 가정적이고 자녀를 무척 사랑한다.',
                       '- 삶을 너무 안일하게 여기는 경향',
                       '- 마음이 따뜻하고, 이야기하기 좋아함',
                       '- 친절하고, 낙천적임',
                       '- 동정심이 많고 어떤 상황이든 잘 적응함',
                       '- 수용력이 강하고 사교적임',
                       '- 주위 사람이나 일어나는 일에 대하여 관심 많음',
                       '- 사람이나 사물을 다루는 사실적인 상식이 풍부함',
                       '- 친구를 좋아하며, 긴 설명을 싫어함',
                       '- 오관으로 보고, 듣고, 만질 수 있는 생활의 모든 것을 즐김',
                       '- 진지함을 요할 때 그러하지 못함 ']


Bloody_mucus = '다혈점액질은 누구나 좋아할 만한 사람이다 다혈질의 부담스럽고 때론 밉살스러운 면이 우아하고 느긋한 점액질의 특성으로 상쇄가 된다. ' \
               '다혈점액질은 태평한 마음과 유머감각으로 다른 사람들을 즐겁게 해주는 낙천가이다. ' \
               '틈만 나면 사람들을 돕고, 다양한 형태의 영업방식을 보인다. ' \
               '다혈질 중에서 가장 덜 외향적인 다혈점액질은 주도적인 행동이나 스스로를 독려하기보다는 주변 상황과 환경에 끌려가는 경향이 있다.' \
               '다혈점액질은 보통 가족에게 성실하고 배우자와 자녀들에게 많은 사랑을 쏟는다. ' \
               '불행히도, 강한 도덕적 신념으로 제약을 받지 않으면 엉뚱한 사람을 사랑하는 불륜으로 이어질 수도 있다.' \
               '다혈점액질의 가장 큰 약점은 의욕과 자제력 부족이다. 일보다 잡담을 좋아하고 진지하게 인생을 살지 않는다. ' \
               '다혈점액질 직원에 대한 사장의 감정은 반반이다. 인간적으로 끌리면서도 한편으론 좀더 열심히 일해 줬으면 하는 것이다.' \
               '다혈점액질은 어지간해선 당황하지 않고 매사를 밝은 쪽으로 해석한다. ' \
               '미소를 머금고 퇴근해서 “이봐, 나 오늘 해고당했어.”라고 말할 사람이다. ' \
               '농담거리가 끝이 없고 다른 사람들을 웃기길 좋아한다. 종종은 심각해야 할 상황에서도 그렇게 한다.'

#담즙다혈
gall_Bloody_summary = ['✍ 장점：외향적, 활동가, 노력가, 결단력, 강한 의지, 근면, 운동 선수',
              '✍ 약점：고집, 자만, 독단, 편견, 성급.',
              '✍ 훈련：남을 공경하는 마음, 약한 자를 돌봄, 험담 삼가, 포용력',
              '✍ 인물：야고보',
              '✍ 은사：가르침, 권면, 다스림, 예언, 지식, 분별, 전도, 믿음, 주는 은사, 목양, 지혜, 돕는 은사, 자비',
              '- 천성적으로 다른 사람들과 잘 사귈 수 있는 능력',
              '- 건설적',
              '- 목적의식이 분명',
              '- 주위 사람들에게 훌륭한 동기부여를 함',
              '- 활동으로 지배된 삶',
              '- 자신과 취미나 능력이 같지 않는 사람은 인정하려 하지 않음',
              '- 독단적이며 자신이 시작한 일을 다른 사람이 끝내주기 원함',
              '- 일 때문에 가정적이지 못하다.',
              '- 열성이 많고, 모험심이 강하며, 천성적인 사교성',
              '- 도전할 때 두려움이 없고 무한한 힘을 나타냄',
              '- 시작하지 말아야했던 계획을 끝까지 고집하는 경향',
              '- 자기 자신을 매우 솔직하다고 생각함',
              '- 논쟁할 때 정확한 근거로 한 것이 아니어도 확신을 가지고 논쟁을 함',
              '- 추상적인 아이디어나 개념에 대해 별로 흥미 없음',
              '- 성급한 행동으로 다른 사람에게도 피해를 줌',
              '- 다른 사람의 의견에 귀를 기울일 필요가 있음']

gall_Bloody = '기질조합 가운데 두 번째로 외향적인 조합은 담즙다혈질이다. 담즙다혈질은 거의 활동에만 전념한다. ' \
              '대부분 생산적이고 목적이 분명한 일에 노력을 기울이지만 때로는 조심해야 한다. ' \
              '한순간에 감정이 폭발해 버릴 수 있기 때문이다! 그는 타고난 홍보가로 거의 모든 걸 팔 수 있다. ' \
              '사람들은 그에게 호감을 느낀다. 그에겐 이웃과 잘 지낼 수 있는 카리스마가 있다. ' \
              '다른 사람들에게 동기를 부여하는 데 능하고 어려움이 닥치면 오히려 힘이 솟는다. ' \
              '두려움을 모르는 무한 에너지로 새로운 모험에 맞선다. 배우자의 평가를 들어보자. ' \
              '“남편에겐 전속력과 정지, 두 가지 속도밖에 없어요.” ' \
              '담즙다혈질은 냉정한 판사와 배심원들의 호감을 얻는 훌륭한 변호사나, 사람들이 저축하려고 마련해둔 돈까지 기부하게 만드는 탁월한 기금모금 전문가가 된다. ' \
              '그는 어디를 가든 관심을 끌고 수월하게 친구를 사귄다. ' \
              '그는 실제적인 설교와 효율적인 교회 행정을 겸비한 유능한 목회자고, “한 번 더” 주민을 대표할 수 있게 법안까지 바꿔놓을 인기 정치가다. ' \
              '또, 사실 관계나 논리가 딸릴 때는 말을 꾸며 허세를 부리거나 으름장을 놓는 설득력 있는 토론가다. ' \
              '특히, 사회과학 분야를 탁월하게 가르치는 교사이다. 수학이나 과학 또는 추상적인 학문에는 별 매력을 느끼지 못한다. ' \
              '어떤 직업을 갖든 언제나 재빨리 두뇌가 돌아간다.' \
              '담즙다혈질의 주된 약점은 적개심이다. 욱하고 분통을 터뜨리는 다혈질의 급한 성미에다 분을 풀 줄 모르는 담즙질의 앙심까지 들어있다. ' \
              '자신도 궤양에 걸리고 다른 사람도 궤양에 시달리게 만들 유형이다. ' \
              '추진력과 에너지가 떨어지는 사람은 봐주질 못하고 잔인하고 신랄하리만큼 솔직한 자신을 자랑스레 여긴다.' \
              '그는 한 번에 한 가지 일에만 집중하지 못하므로 자신이 벌일 일을 마무리하기 위해 다른 사람들을 끌어 들인다. ' \
              '자기주장이 강하고 편파적이고 성급한 그는 어쩌면 처음부터 시작하지 말았어야 할 일을 끈질기게 끝내려 든다. ' \
              '제어를 받지 않으면 자신의 모든 행동을 정당화하고 목표를 달성하기 위해 주저 없이 다른 사람들을 조종하고 짓밟을 유형이다.' \
              '대부분의 담즙다혈질은 일에 몰두하느라 가족과 친구들을 소홀히 하고, 그들이 불평하면 폭언까지 일삼는다. ' \
              '담즙다혈질 남자의 아내는 자신이 사랑받지 못하는 쓸모없는 존재라 느끼고 소외감에 시달린다. ' \
              '그녀는 남편을 존경하면서도 두려워하고 적개심을 품는다. 그래서 자녀들이 장성하고나면 남편의 곁을 떠나기도 한다. ' \
              '그러나 그런 남자라도 자신이 가족을 사랑하고 인정하는 일이 얼마나 중요한지 깨달으면 식구들 하나하나를 사랑하고 집안 전체를 변화시킬 수 있다.' \
              ' 담즙다혈질 아내는 자신이 좋아하는 일에 몰두한 나머지 남편에게 소홀하기도 한다.'

#담즙우울
gall_depressed_summary = ['✍ 장점：독립심, 생산적인 능력, 분석력.' ,
                         '✍ 단점：분노, 고집, 비판, 거친 언어(잠 13：3), 독재자, 간섭자.' ,
                         '✍ 훈련：부드러운 애정 표시, 이해심을 길러 주어야 함' ,
                         '✍ 인물：바울' ,
                         '✍ 은사：가르침, 권면, 예언, 다스림, 지식, 지혜, 분별, 전도, 주는 은사, 목양, 믿음, 자비, 돕는 은사' ,
                         '- 매우 근면하고 유능한 사람' ,
                         '- 목적의식이 분명하고 섬세한 면을 지니고 있음.' ,
                         '- 타고난 지도자적인 기질' ,
                         '- 명령형의 독재형' ,
                         '- 심각할 정도의 적의나 분노를 품기 쉬움' ,
                         '- 엄격한 훈육형의 아버지가 되기 쉬움',
                         '- 매사에 철저하며, 사리분별력이 뛰어남' ,
                         '- 일처리에 있어서 신중하며 책임감이 강함' ,
                         '- 영리하고, 분석적인 마음을 소유하고 있음' ,
                         '- 특별한 일을 할 수 있는 철저한 지도자로 자신을 계발시킴' ,
                         '- 어떤 사실에 확신이 없다면 절대로 논쟁하지 않음' ,
                         '- 모든 일에 있어서 매우 경쟁적이나 일하는 습관에 있어서는 불규칙적임' ,
                         '- 때로는 빈정대는 말투로 사람들을 당황하게 만듦']


gall_depressed = '담즙질과 우울질의 비율이 6대 4인 사람은 아주 근면하고 유능하다. ' \
                 '담즙질의 낙관론과 실행력이 우울질의 변덕을 극복하기 때문에 담즙우울질은 목표 지향적이면서도 꼼꼼하다. ' \
                 '그는 학교 공부도 잘하고, 분석력이 뛰어나고, 머리 회전이 빠르면서도 과단성이 있다. 담즙우울질은 탁월하게 일을 처리하는 유능한 리더가 된다. ' \
                 '이 사람이 변호사라면 더 바랄 나위가 없을 것이다. 담즙우울질은 논쟁에 탁월한 데다 아주 작은 일까지 정확히 기억한다. ' \
                 '사실을 정확히 알고 있지 않는 한 담즙우울질에게 시비를 걸지 말라! 담즙우울질은 좀처럼 질줄 모른다. ' \
                 '그의 전략은? 급소를 집중 공략하라! 그는 어떤 직업에서도 대개 성공을 거둔다. ' \
                 '캘리포니아 모 병원의 탁월한 외과과장인 담즙우울질 의사는 비범한 성경교사이기도 하다. ' \
                 '이 기질의 사람은 최고의 리더가 될 가능성이 높다. ' \
                 '제2차 세계대전에서 독일군을 베를린으로 퇴각시킨 미육군 3군 사령관 조지 패튼 장군도 담즙우울질이었을 것이다.' \
                 '담즙우울질의 약점은 강점 못지않게 크다. 존경과 증오를 동시에 불러일으키는 “독재자” 성향이 있기 때문이다. ' \
                 '자기주장이 강하고 상대가 듣고 싶어 하건 말건 자기 생각을 주저 없이 표현한다. ' \
                 '논쟁을 즐기고 논쟁에 이기기 위해서라면 자기 입장과 다른 주장도 서슴지 않는다. ' \
                 '약삭빠른 언변가인 그의 비꼬는 말에 사람들은 큰 상처를 입는다. 상처만 주는 정도가 아니라 비참하게 만든다. ' \
                 '일하는 습관은 불규칙하지만 한번 일할 때 장시간 일하는 타고난 행동가이다.' \
                 '담즙우울질은 상당한 증오심과 원한을 품을 수 있다. 부모의 충분한 사랑을 받지 못하면, 대인관계, 특히 가족과의 관계에 어려움을 겪는다. ' \
                 '담즙우울질은 지나치게 자녀를 징계하는 가혹한 부모가 될 수 있다. 담즙질답게 좀처럼 만족할 줄 모르는 데다 우울질의 완벽주의 성향까지 갖고 있다. '

#담즙점액
gall_mucus_summary = ['✍ 장점：안정, 계획과 실천을 조화, 경영가.' ,
                     '✍ 약점：실수를 인정하지 않음, 가시돋힌 유머, 고집, 완고, 남을 곤경에 빠뜨림, 갑상선.' ,
                     '✍ 훈련：이기심을 버림, 양보하는 습관.' ,
                     '✍ 인물：디도' ,
                     '✍ 은사：가르침, 권면, 다스림, 예언, 지식, 지혜, 분별, 주는 은사, 목양, 전도, 믿음, 돕는 은사, 자비.' ,
                     '- 계획과 열성적인 직업 수행을 잘 조화시키는 조직가' ,
                     '- 다른 사람들이 능력을 발휘할 수 있도록 도와 줌' ,
                     '- 표현하지는 않지만 분노와 모진 마음을 품고 있음' ,
                     '- 고집 세고 완고한 사람, 실수를 잘 인정치 않음' ,
                     '- 신중하고, 조용하고, 차분함' ,
                     '- 친근하고, 책임감이 있으며, 헌신적임' ,
                     '- 성급, 활동적, 격렬한 기질과 함께 조용하고, 냉정하고, 흥분하지 않는 기질로 혼합되어 있음' ,
                     '- 목표가 뚜렷하고 분명하기 때문에 주위 사람들이 그와 함께 혹은 그를 위해 일하기를 좋아함' ,
                     '- 한 번 행한 것은 마음을 바꾸기가 매우 어려움' ,
                     '- 때론 신랄한 말과 비평 대신에 말의 가시는 영리하게 감춰서 유머로 나타낸다. 기질 중에서 고집 세고 완고하다.']


gall_mucus = '담즙점액질은 외향적 기질 가운데 가장 차분한 기질 조합이다. ' \
             '재빠르고 활동적이고 열정적인 데다 침착하고 태연하고 담담한 면이 섞여 있다.' \
             '담즙점액질은 이제까지 살펴본 다른 외향적인 기질들처럼 재빨리 상황 속에 뛰어들지 않고 좀더 신중하고 차분하다. ' \
             '처음에는 그렇게 보이지 않을지라도, 길게 보면 대단히 유능한 사람이다.' \
             '담즙점액질은 주의 깊게 계획을 세운 다음 열심히 일하는, 상당히 조직적인 사람이다.' \
             ' 사람들은 그와 함께 일하길 좋아한다. 분명한 목표와 세부추진 계획까지 다 세워놓고 일하면서도 사람들을 심하게 몰아세우지 않는다. ' \
             '다른 사람들이 각자의 능력을 최대한 발휘하도록 도울 줄 알고 남에게 상처를 입히거나 이용당한다는 느낌을 주지 않는다.' \
             '혼자 일을 다 해내야 한다는 강박관념이 없고 항상 다른 사람들과 함께 하는 방향으로 생각하기 때문에 어느 기질보다 많은 일을 해낸다. ' \
             '그의 모토는? 열 사람을 불러 모아 할 수 있는데 왜 혼자 열 사람 몫을 하는가?' \
             '담즙점액질은 거의 모든 분야에서 탁월한 행정가일 뿐 아니라 좋은 남편과 아버지가 된다. ' \
             '그의 역량이 출중하긴 하지만 눈에 띄는 약점이 없는 건 아니다. 그는 벌컥 화를 내지는 않지만 적개심과 앙심을 품는다. ' \
             '담즙질의 날카로운 비아냥거림은 점액질의 우아함으로 어느 정도 무마된다. ' \
             '가시 돋친 말을 유머로 교묘하게 포장한다. 상대방은 농담인지 조롱인지 알 수 없게 된다.' \
             '담즙점액질은 그 누구보다 완고하고 고집이 세다. 회개하거나 잘못을 인정하기 어려워한다. ' \
             '그 결과 자신이 잘못한 사람에게 사과하지 않고 “보상하려” 든다. ' \
             '소심한 점액질의 특성 때문에 담즙질의 진취성이 억눌려 잠재력을 충분히 발휘하지 못 할 수도 있다. '

#우울다혈
depressed_Bloody_summary = ['✍ 장점：천부적인 예술가, 창조자, 학자, 헌신자, 순교자' ,
                           '✍ 단점：자기관용 부족, 비판적인 자세, 비사교적, 완고함, 심각한 자기 연민' ,
                           '✍ 훈련：감사하는 마음, 운동 노력, 사랑과 관용' ,
                           '✍ 인물：세례 요한, 엘리야' ,
                           '✍ 은사：예언, 권면, 지혜, 전도 목양, 자비, 가르침, 지식, 다스림, 주는 은사, 돕는 은사, 불별, 믿음.' ,
                           '- 천부적인 재능을 가진 사람' ,
                           '- 음악가, 미술가로써의 특징, 훌륭한 학자' ,
                           '- 쉽게 눈물을 흘리고 모든 것을 심각하게 생각함' ,
                           '- 비이성적인 비판을 하고 다른 사람에 대해서도 까다롭게 대함' ,
                           '- 통찰력․직관력이 뛰어나며, 예술적 재능이 뛰어남' ,
                           '- 독창성과 천부적인 재능을 가졌음' ,
                           '- 우울질적인 탐구심과 다혈질적인 창의력이 조화됨' ,
                           '- 기분에 좌우되는 복합성을 보여 주는 감정의 창조자' ,
                           '- 환경의 영향을 받아 상상으로도 행복한 분위기를 나타내기도 함' ,
                           '- 일이 잘못되거나 거절당하고, 모욕당하고, 상처를 입는다면 자기 연민의 결과로 젖어들기도 함' ,
                           '- 감정의 변화에 따라 쉽게 눈물을 흘림' ,
                           '- 자신을 비하해 모든 것을 심각하게 생각하기도 함' ,
                           '- 완벽주의적 경향이 있어서 이상적이고 비실제적인 방법으로 일이 진행되지 않으면 협조하지 않는 경향']

depressed_Bloody = '우울다혈질은 유능한 학자이고 교직, 그것도 고등학생이나 대학생을 가르치는 일에 누구보다 적임이다. ' \
                   '우울질 특성 덕에 잘 알려지지 않은 사실을 찾아내고 세부사항까지 정확히 사용하는 한편, ' \
                   '다혈질 특성 덕에 학생들과 잘 통한다. 흔히 사회과학이나 신학, 철학, 문학 등을 전공한다.' \
                   '우울다혈질은 때로 컴퓨터나 사무기기나 학습 교재 등을 판매하는 업무를 맡는다. ' \
                   '그런 일은 상세 정보와 사실을 잘 전달해야 하고, 상대적으로 스트레스가 적다. 그는 유능한 변호사나 의사감이다.' \
                   '우울다혈질은 대단히 유능하지만 보통은 다른 사람 밑에서 일한다. 자기 사업을 시작하거나 조직을 설립할 만한 배짱은 없다.' \
                   '우울다혈질은 좋은 배우자와 충실한 부모가 된다. 다만 배우자와 자녀를 있는 모습 그대로 받아들이고 비판을 자제하는 법을 배워야 한다.' \
                   '일반적으로 그는 재능이 많고 청중의 마음을 사로잡는 연주가의 자질이 다분하다. ' \
                   '많은 위대한 연기자와 오페라 스타, 컨트리 뮤직 가수들이 우울다혈질이다. ' \
                   '오늘날의 포크송과 발라드 대부분은 우울다혈질의 작품이다. ' \
                   '우울다혈질은 재미있는 사회자나 교인들과 잘 지내는 목회자가 된다. ' \
                   '또 화가가 되면 그림을 잘 그릴 뿐 아니라 자신의 작품을 잘 판다. 물론 팔 생각이 있을 때의 얘기다.' \
                   '우울다혈질은 감정의 기복이 아주 흥미롭다. 상황이 흡족할 땐 엄청 행복감을 느낀다. ' \
                   '그러나 상황이 안 좋아지거나 거절당하거나 모욕감을 느끼거나 마음이 상하면 자기 연민의 바다에 잠겨버린다. ' \
                   '우울질이 두드러진 다른 기질조합과 마찬가지로 우울다혈질도 생각의 흐름을 잘 다스려야 한다. ' \
                   '쉽게 감동하는 탓에 눈물을 잘 흘리고 다른 사람들에게 가혹하게 굴 수 있다. ' \
                   '일이 뜻대로 풀리지 않을 때는 완고해지고 비협조적으로 나올 수도 있다. 물론 바람직하지 않고 도움될 것도 없는 처사이다.' \
                   '스스로 만든 초라한 자화상 때문에 자신의 잠재력을 제대로 발휘하지 못하고 두려움과 불안에 사로잡히기도 한다. ' \
                   '스스로 인식하고 있는 것보다 훨씬 유능하지만 좀처럼 밖으로 드러나지 않으니 사람들은 대개 그의 재능을 알아차리지 못한다. '

#우울담즙

depressed_gall_summary = ['✍ 장점：강력한 지도자, 지휘자, 다방면의 능력자, 세심한 분석력.' ,
                         '✍ 약점：짜증, 이기심, 피해의식, 적대감, 거역, 만족함이 없음.' ,
                         '✍ 훈련：칭찬과 격려, 정돈, 감사하는 마음' ,
                         '✍ 인물：누가, 모세' ,
                         '✍ 은사：예언, 권면, 가르침, 지혜, 다스림, 목양, 자비, 지식, 분별, 전도, 주는 은사, 믿음, 돕는 은사' ,
                         '- 강력한 지도력을 가짐, 세심한 분석력과 완벽성' ,
                         '- 오케스트라와 합창단의 지휘자' ,
                         '- 자기 자신에 대한 만족하지 않음' ,
                         '- 자기 학대, 적대감, 비평의 성향' ,
                         '- 조울증에 걸리기 쉬움' ,
                         '- 신중하고, 집중력이 강하며, 현실적임' ,
                         '- 실질적이고 현실감각이 뛰어나며 일을 조직하고, 계획하여 추진시키는 능력이 있음' ,
                         '- 자기 의지와 결심에 의해 안정되어 있음' ,
                         '- 타고난 지도자로써 일의 목표를 설정하고, 지시하고 결정하고 이행하는 능력이 있음' ,
                         '- 인간관계에 있어서 스스로 자신의 마음이나 감정 그리고 말투를 드러냄' ,
                         '- 한 번 어떤 것이나 어떤 사람(자신 포함)에 대해 부정적으로 생각하기 시작하면 함께 있기가 어려움' ,
                         '- 지나친 자기 학대, 적대감, 비평의 성향을 나타냄']

depressed_gall = '우울담즙질은 우울질 특유의 감정의 기복이 담즙질의 의지력과 결심으로 다소 안정감을 찾은 형태이다. ' \
                 '이 사람은 거의 모든 작업을 가질 수 있다. 완벽주의자에다 추진력도 갖추고 있다. ' \
                 '특히 조사와 정확성을 요하는 법률 분야에서 탁월한 변호사가 된다. ' \
                 '어느 누구보다 사건 준비를 배 이상 열심히 하기 때문에 좀처럼 지지 않는다. ' \
                 '의사인 경우 최신 의학용어까지 꿰고 있고 환자들에게도 중요한 사실들을 분명히 각인시킨다. ' \
                 '위대한 교향악단 지휘자와 합창단 지휘자들 중 다수가 우울담즙질이다. ' \
                 '강력한 리더십 자질을 갖추고 있고 “이사장” 노릇을 즐기며 준비 없이 회의에 참석하는 법이 없다. ' \
                 '교육계에 몸담은 경우 교실을 떠나 교육행정가가 되는 경우가 많다.' \
                 '정치권에 입문하기도 하고, 스포츠 분야의 많은 슈퍼스타들(특히 야구투수들)또한 우울담즙질이다.' \
                 '우울다혈질과 달리 우울담즙질은 자신의 이름을 내건 조직이나 기관을 설립하고 소란스럽지 않으면서 자연스럽고 효율적으로 운영할 수 있다. ' \
                 '많은 선교기관, 대학, 기독교 단체의 설립자들이 성령 충만한 우울담즙질이다.' \
                 '우울담즙질의 타고난 약점은 생각과 감정과 입에서 드러난다. ' \
                 '그는 정말 만족시키기가 너무나 어려운 사람이다. ' \
                 '사람(자기 자신도 포함)이나 사물에 대해 부정적으로 생각하기 시작하면 도저히 같이 지내기 어려운 타입이 된다. ' \
                 '우울담즙질의 감정은 생각의 흐름에 따라간다. 우울질이 섞인 다른 두 기질조합만큼 우울증에 오래 빠져있지는 않지만, ' \
                 '우울증에 빠지는 속도는 오히려 더 빠를 수 있다. ' \
                 '우울질과 담즙질은 자기 학대와 증오와 비판에 시달리는 두 가지 기본 기질이다. ' \
                 '이 두 가지가 우울담즙질에서 만났으니 상황이 어려울 때 이 사람이 죽을 생각까지 하는 것도 이상할 것이 없다. ' \
                 '우울담즙질은 가족에 대한 불만을 “과장하고” 집 안팎에서 그들에게 몹쓸 말을 해서라도 실수를 바로잡아야 한다고 느낀다.' \
                 '우울담즙질은 분노와 복수심이라는 꿍한 마음 때문에 놀라운 잠재력에 걸맞게 살지 못한다. '

#우울점액

depressed_mucus_summary = ['✍ 장점：친화성, 발명가, 수학자, 의학자, 예술성.' ,
                          '✍ 약점：이기심, 예민, 두려움, 걱정, 낙심.' ,
                          '✍ 훈련：사랑, 관용, 나눔' ,
                          '✍ 인물：사도 요한' ,
                          '✍ 은사：지혜, 예언, 가르침, 권면, 자비, 목양, 자식, 다스림, 돕는 은사, 전도, 주는 은사, 분별, 믿음' ,
                          '- 거의 적대감을 가지지 않고 다른 사람들과 잘 사귐' ,
                          '- 매우 글을 잘 쓰며, 훌륭한 수학자' ,
                          '- 쉽게 낙심하고, 매우 부정적인 사고를 함' ,
                          '- 두려움이나 걱정 그리고 무능한 자기 가치의 감정, 양심적인 성향이 강함' ,
                          '- 조용하고, 논리와 비판분석력이 뛰어나며, 사고가 독창적임' ,
                          '- 말없이 다정하고 끝없는 활동범위까지 연구하고 탐구하기 위해 조용하고 혼자 있는 환경을 좋아함' ,
                          '- 우울질의 분석적 완전주위와 점액질의 조직적인 능력이 복합되어 내성적인 기질을 나타냄' ,
                          '- 빠른 이해와 높은 직관력으로 통찰하는 재능과 지적 호기심이 많음' ,
                          '- 세계적으로 위대한 학자, 발명, 의학적 발견 등의 분야에서 뛰어난 재능을 보임']

depressed_mucus = '세계 최고의 학자들은 우울점액질이었다. 그들은 앞서 살펴본 두 우울질처럼 쉽사리 적개심을 품지 않고 일반적으로 다른 사람들과도 잘 지낸다. ' \
                  '재능 많고 내성적인 이 사람은 우울질의 분석적 완벽주의에다 점액질의 조직적 효율성을 모두 갖추고 있다. ' \
                  '연구와 조사에 필요한 혼자만의 조용한 환경에서 활력을 얻는 성격 좋은 인도주의자이다.' \
                  '우울점액질은 대개 철자에 대단히 민감하고 수학도 잘한다. ' \
                  '고등교육뿐 아니라 의학과 약학, 치의학, 건축, 장식, 문학, 신학, 그 외 다른 많은 “지적” 분야에서 두각을 드러낸다. ' \
                  '또한 존경받는 작가이자 철학자, 과학자이며 건축과 음악, 예술계의 거장이다. ' \
                  '극히 꼼꼼하고 정확한 우울점액질은 훌륭한 회계사와 부기계원과 공인회계사가 된다. ' \
                  '의학이나 치의학분야에서 전문의가 되는 이들도 드물지 않다. ' \
                  '세계의 중요한 발명과 의료계의 발견을 이루어낸 사람 대부분이 우울점액질이다. ' \
                  '우울점액질은 두려움과 불안과 부정적인 자화상에 유난히 쉽게 무너진다. ' \
                  '위대한 재능과 역량을 가진 사람들이 자신을 하찮게 여기는 자기 생각의 희생자가 될 수도 있다.' \
                  '우울점액질은 보통 조용한 편인데 복수심을 품다 증오에 사로잡힐 수도 있다. ' \
                  '감정의 기복이 심하면서도 완고하고, 외고집에다 비타협적이 되기도 한다. ' \
                  '우울점액질은 양심에 따라 행동하려는 마음이 강하다. 그렇다 보니 다른 사람들의 압력에 놀려 이런저런 일들을 떠맡느라 에너지와 창의력을 소진하기도 한다. ' \
                  '어려운 사람들을 돌아보느라 가족에게 많은 시간을 할애하지 못하는 경우도 있다. '

#점액다혈
mucus_Bloody_summary = ['✍ 장점：명랑, 협력, 모범가, 외교성, 완벽한 성격' ,
                       '✍ 약점：게으름, 집착, 수줍음, 소심, 덤벙댐' ,
                       '✍ 훈련：엄함은 자제(부모), 정리 정돈, 동기의식 고취' ,
                       '✍ 인물：디모데' ,
                       '✍ 은사：자비, 목양, 가르침, 돕는 은사, 지혜, 전도, 예언, 권면, 지식, 다스림, 분별, 주는 은사, 믿음' ,
                       '- 명랑하고 즐겁고 협조적이고 사려 깊음' ,
                       '- 친구를 잘 사귀며 외교적이고 신뢰 할 수 있음' ,
                       '- 장난을 좋아하고 유머가 있는 사람들' ,
                       '- 친절하고, 모범적이며 가정적인 사람' ,
                       '- 너무 순하며 동기부여의 부족' ,
                       '- 훈련의 부정' ,
                       '- 소심하며 자기 패배적' ,
                       '- 마음이 따뜻하고, 동정심이 많으며 장난을 좋아함' ,
                       '- 아이들과 어른들이 모두 좋아하며 성격을 다듬어서 나타내지 않아도 되어서 주어진 시간동안 가장 사이좋게 지낼 수 있는 느긋한 기질' ,
                       '- 보통 평온한 삶을 즐김' ,
                       '- 너무 순진하므로 점액질의 동기부여 부족과 다혈질의 훈련의 부족을 이어받음' ,
                       '- 많은 노력이 필요한 일은 어떤 것이든 피하려 함']


mucus_Bloody = '열두 가지 기질 조합 중에서 가장 오랫동안 지내기 쉬운 유형은 점액다혈질이다. ' \
               '붙임성 있고, 유쾌하고, 협조적이고, 사려 깊고, 사람을 소중히 여기고, 원만하고, 믿을 수 있고, 재미있고 유머감각도 있다. ' \
               '애 어른 할 것 없이 이웃의 사랑을 듬뿍 받는다. 판매업종을 직업으로 택하는 경우는 드물지만 강매에 대한 부담만 없다면 판매도 잘할 수 있다. ' \
               '교육계로 진출하는 경우가 많고 행정이나 회계, 역학, 공학 분야에서도 뛰어나다. ' \
               '장의사 과학자, 통계학자, 라디오 아나운서, 카운슬러, 목회자, 수의사, 농부, 건설노동자도 많다.' \
               '대개 가족들과 평온한 생활을 즐기고 배우자와 자녀들을 사랑한다.' \
               '점액다혈질의 약점은 다른 기질처럼 두드러지지 않으나, 늘 함께 살아야 하는 사람에게는 그리 사소한 문제가 아니다. ' \
               '그것은 점액질답게 별로 아쉬울 게 없고 다혈질답게 자제력이 부족하여 잠재력을 충분히 살리지 못하는 경우가 많다는 것이다. ' \
               '학교를 중퇴하고 좋은 기회를 흘려버리며 “너무 많은 노력”이 필요한 일은 피하곤 한다. ' \
               '빈둥거리며 고독을 즐기고 세월이 지나는 것에도 그리 개의치 않다가 고만고만하게 살아가는 경향이 있다.' \
               '두려움과 염려는 점액다혈질에게 터무니없는 불안감을 불러일으키는 또 다른 골칫거리다. ' \
               '조금만 더 믿음을 가지면 소심함과 자멸적인 불안을 떨치고 변화될 수 있는데 ' \
               '점액다혈질은 오히려 자기 껍질을 단단하게 만들고 자신과 가족에게 유익한 활동을 외면하여 굴러오는 복을 차버린다. '

#점액담즙
mucus_gall_summary = ['✍ 장점：지도력, 상담가, 친화력' ,
                     '✍ 약점：완고, 소극성, 안주성, 자기중심' ,
                     '✍ 훈련：자제력 시정(TV), 표현력 개발, 양보와 협력' ,
                     '✍ 인물：아브라함' ,
                     '✍ 은사：목양, 자비, 다스림, 지혜, 돕는 은사, 가르침, 전도, 예언, 분별, 지식, 믿음, 주는 은사.' ,
                     '- 바른 것을 따르고, 좀처럼 규범을 벗어나지 않음' ,
                     '- 활동적이나 정열적이지는 않음' ,
                     '- 매우 완고하고 고집이 셈' ,
                     '- 안주하려는 경향' ,
                     '- 사교적이고, 차분하며, 친근함' ,
                     '- 책임감이 있으며, 충실함' ,
                     '- 쉽게 사람을 사귀고 집단에서 뛰어난 지도자의 재능을 가지고 있음' ,
                     '- 온유한 마음으로 좋은 상담자, 조직화된 사무실에서 제일의 전문가가 될 잠재성이 있음' ,
                     '- 다른 사람에게 타격을 주지는 않지만, 단순히 양보하거나 협력하는 것을 거절함' ,
                     '- 천성적으로 싸움을 좋아하지 않지만, 내적인 분노와 완고함은 침묵으로 나타남' ,
                     '- 직장에 혼자 늦게까지 남아 있거나 밤마다 TV에 마음을 빼앗기기도 함' ,
                     '- 나이가 들수록 이기적으로 좀 더 안주하려는 경향에 빠져 소극적으로 되는 경향이 있음']


mucus_gall = '점액질 중 가장 활동적인 유형이 점액담즙질이다. 그래도 점액질이 두드러진 사람이라 활동가가 되긴 어렵다. ' \
             '다른 점액질과 마찬가지로 함께 지내기 무난하고 모임의 탁월한 리더가 되기도 한다. ' \
             '적절한 훈련을 받으면 유능한 십장이나 부사장, 회계사, 교육가, 기획가, 그리고 거의 모든 건축 분야의 노동자가 될 수 있다. ' \
             '점액질은 경청할 줄 알고 다른 사람에게 진정한 관심을 보이기 때문에 좋은 상담가의 자질이 있다. ' \
             '점액담즙질이 다른 사람들을 위해 봉사하는 일은 거의 없지만, 자신이 책임자로 있는 조직적인 사무실 안에서는 대개 일급 전문가이다. ' \
             '그의 조언은 실제적이고 유용하다. 언제나 옳은 일만 할 사람이지만 좀처럼 정해진 틀을 벗어나진 않는다. ' \
             '점액담즙질의 약점은 언뜻 명백하지 않지만 가정에서 서서히 그 모습을 드러낸다. ' \
             '그도 역시 다른 점액질들처럼 아쉬운 게 없고 두려움이 많다. 게다가 완강하게 고집을 피우고 뜻을 굽히지 않는다. ' \
             '다른 사람들에게 분통까지 터뜨리진 않지만 반항하거나 비협조적으로 나온다. ' \
             '점액담즙질은 싸움이나 시위를 벌이진 않는다. 그러나 그들의 숨은 분노와 고집이 종종침묵으로 표출된다. ' \
             '점액담즙질은 종종 “작업장”이나 “둥지”로 물러가 혼자 조용히 시간을 보낸다. 밤마다 텔레비전 속으로 빠져들기도 한다. ' \
             '안 그래도 이기적이라 할 만큼 앉아있기 좋아하는 사람이 나이가 들수록 점점 더 수동적이 되어간다. ' \
             '자신은 편안하게 오래 살 가능성이 높지만, 가족의 필요와 관심을 생각해야 한다. 그리고 적극적인 사람이 되고자 애써야 한다.'

#점액우울

mucus_depressed_summary = ['✍ 장점：친절, 온유, 자비, 구제, 신뢰' ,
                          '✍ 약점：내향적인 성격, 자기 주장이 약함, 동작이 느림, 소극성, 두려움' ,
                          '✍ 훈련：주위 사람들의 변함없는 사랑, 규칙적인 생활, 저혈압' ,
                          '✍ 인물：바나바' ,
                          '✍ 은사：목양, 자비, 지혜, 돕는 은사, 예언, 권면, 가르침, 다스림, 전도 지식, 분별, 주는 은사, 믿음' ,
                          '- 주로 너무 말을 하지 않으며, 때로는 말이 너무 없어 과묵함' ,
                          '- 단정하고 조직적으로 일함' ,
                          '- 압력 밑에서 일을 잘 함' ,
                          '- 말없이 다정하고, 온화하며, 내적 신념이 깊음' ,
                          '- 12기질 줄 가장 친절하고, 온유하며 조용함' ,
                          '- 어떤 상황이든 화를 내거나 적대감을 품는 일이 거의 없으며, 절대로 변명하는 일이 없음' ,
                          '- 자기 자신이나 남들을 난처하게 하지 않음' ,
                          '- 항상 합당하게 행동하므로 신뢰를 줌' ,
                          '- 자비와 구제의 은사를 가지고 있는 경향이 있음' ,
                          '- 집 근처에 머물기를 좋아하고 수리하는 것을 좋아함' ,
                          '- 두려움, 이기심, 소극성, 비판적 성향이 있음' ,
                          '- 자기 정체성이 결여되기도 함' ,
                          '- 자신들의 과다확장이나 과잉참여를 두려워함' ,
                          '- 어떠한 종류의 가입이나 협력을 거부하기도 함']


mucus_depressed = '점액우울질은 모든 기질조합 중에서 가장 품위 있고 부드럽고 조용하다. ' \
                  '좀처럼 화를 내거나 적개심을 품지 않고 사과할 말은 아예 하지도 않는다.' \
                  '(그건 무엇보다도 말이 많지 않기 때문이다.) 곤경을 자초하거나 다른 사람들을 난처하게 하지 않고 언제나 적절한 행동만 한다. ' \
                  '또, 소박한 옷차림에, 믿을 수 있고, 정확하다. 점액우울질은 자비를 베풀어 남을 돕는 방면에 재능이 있다. ' \
                  '사회생활을 시작하면 함께 일하는 동료들의 필요를 잘 헤아리게 된다. ' \
                  '그는 깔끔하고 조직적으로 일한다. ' \
                  '사진 촬영과 출력, 목록 작성과 분석, 레이아웃, 광고, 역학, 교육, 제약, 치의학, 시계 제작, ' \
                  '도목수일(일하는 속도가 느리기 때문에 개별 작업은 거의 맡지 않는다), 유리세공, 도배와 페인트칠, ' \
                  '그 외 세밀한 작업과 대단한 인내가 필요한 일들을 잘 소화해낸다. 점액우울질은 점액질답게 집안일을 잘하고 여력이 있는 대로 집안 곳곳을 수리한다.' \
                  '약점을 살펴보자면, 점액우울질 아버지는 자녀들이 생산적이고 절제할 줄 아는 어른이 되는 데 필요한 징계를 소홀히 하는 경향이 있다. ' \
                  '좀처럼 인정되지 않는 사실이지만, 자녀들이 자라면서 부모에게 말대꾸하고 ' \
                  '불순종하는 것을 방치하는 수동적인 아버지는 불합리한 징계로 자녀의 원한을 사는 독재자 부모만큼이나 자녀를 노엽게 한다. ‘' \
                  '점액우울질 남자의 아내가 남편의 수동적인 성향을 파악하고 그가 가장 역할을 하도록 재치 있게 기다려 주면 ' \
                  '두 사람은 행복한 가정과 부부관계를 누릴 수 있을 것이다.' \
                  '점액우울질의 다른 약점들은 두려움과 이기심, 부정적 사고방식, 비판, 건전한 자아상의 결핍에서 나온다. ' \
                  '대부분의 점액우울질은 어떤 활동에 참여하는 데 지나친 거부감을 갖는다. ' \
                  '도에 지나치게 빠져 버리거나 말려들면 어쩌나 겁을 내어 무슨 일이건 거의 자동적으로 거부한다. ' \
                  '내적으로는 동기 부여가 안 되는 기질이므로 자기에게 벅차다 싶을 정도의 책임을 떠맡을 필요가 있다. ' \
                  '그러한 외적 자극 덕분에 큰일을 이룰 수 있을 것이다. '



explanation_dic =  {'first_explanation' : first_explanation, 'Bloody' : Bloody, 'gall' : gall, 'depressed' : depressed,
                    'mucus' : mucus, 'Bloody_gall_summary' : Bloody_gall_summary, 'Bloody_gall' : Bloody_gall, 'Bloody_depressed_summary' : Bloody_depressed_summary,
                    'Bloody_depressed' : Bloody_depressed, 'Bloody_mucus_summary' : Bloody_mucus_summary,'Bloody_mucus' : Bloody_mucus,
                    'gall_Bloody_summary' : gall_Bloody_summary, 'gall_Bloody' : gall_Bloody, 'gall_depressed_summary' : gall_depressed_summary,
                    'gall_depressed' : gall_depressed, 'gall_mucus_summary' : gall_mucus_summary, 'gall_mucus' :gall_mucus,
                    'depressed_Bloody_summary' : depressed_Bloody_summary, 'depressed_Bloody' : depressed_Bloody,
                    'depressed_gall_summary' : depressed_gall_summary, 'depressed_gall' : depressed_gall,
                    'depressed_mucus_summary' : depressed_mucus_summary, 'depressed_mucus' : depressed_mucus,
                    'mucus_Bloody_summary' : mucus_Bloody_summary, 'mucus_Bloody' : mucus_Bloody,
                    'mucus_gall_summary' : mucus_gall_summary, 'mucus_gall' : mucus_gall,
                    'mucus_depressed_summary' : mucus_depressed_summary, 'mucus_depressed' : mucus_depressed}


image_dic = {'Bloody_gall' : 'Peter','Bloody_depressed' : 'David', 'Bloody_mucus' : 'Apollo',
                    'gall_Bloody' : 'James', 'gall_depressed' : 'Paul', 'gall_mucus' :'Titus',
                    'depressed_Bloody' : 'John','depressed_gall' : 'Moses','depressed_mucus' : 'John the Apostle',
                    'mucus_Bloody' : 'Timothy','mucus_gall' : 'Abraham','mucus_depressed' : 'Barnabas'}

image_dic_ko = {'Bloody_gall' : '베드로','Bloody_depressed' : '다윗', 'Bloody_mucus' : '아볼로',
                    'gall_Bloody' : '야고보', 'gall_depressed' : '바울', 'gall_mucus' :'디도',
                    'depressed_Bloody' : '세례요한','depressed_gall' : '모세','depressed_mucus' : '사도요한',
                    'mucus_Bloody' : '디모데','mucus_gall' : '아브라함','mucus_depressed' : '바나바'}

en_ko = {'Bloody_gall' : '다혈담즙','Bloody_depressed' : '다혈우울', 'Bloody_mucus' : '다혈점액',
                    'gall_Bloody' : '담즙다혈', 'gall_depressed' : '담즙우울', 'gall_mucus' :'담즙점액',
                    'depressed_Bloody' : '우울다혈','depressed_gall' : '우울담즙','depressed_mucus' : '우울점액',
                    'mucus_Bloody' : '점액다혈','mucus_gall' : '점액담즙','mucus_depressed' : '점액우울'}